{
  "aboutIntro": {
    "primary": "I am a multi-disciplinary engineer, leader, and student. I'm passionate about success through effective practice, strong communication, and asymmetric risk taking.",
    "expanded": [
      "I grew through a career of tight teams in fast-paced initiatives. I've had experience building unique products in a range of environments, from non-profits to government and commercial.",
      "I measure my success by the strength of those around me. My greatest passion is to distill the simple from the complex, and to find flow and trust within my teams."
    ]
  },
  "jobs": [
    {
      "title": "Capital One",
      "link": "https://www.capitalone.com/",
      "dates": "2024-2025, 2021-2022",
      "position": "Principal Software Engineer",
      "skills": "Security, Splunk, New Relic, PagerDuty, Springboot, Astro, SolidJS, Node.js, DevSecOps",
      "description": "Led security operations, remediation, and engineering for high-scale applications serving 3m+ DAU, achieving zero security incidents while delivering secure microservices and customer-facing features.",
      "expandedContent": "▸ Engineered high-traffic microservices and customer-facing features (Trade-In, Auto Loan Rates, SEO) using modern frameworks (Astro, SolidJS, Node.js), architecting scalable solutions serving millions of daily users with robust performance and zero production vulnerabilities.<br>\n▸ Led production security monitoring and incident response operations using Splunk and New Relic, creating custom SPL queries for threat detection, building real-time alerting dashboards, and providing 24/7 on-call support via PagerDuty to ensure rapid response to security events.<br>\n▸ Drove platform reliability and security remediation initiatives across 3M+ DAU applications, leading Springboot upgrades and vulnerability patching programs, enhancing CI/CD pipelines to strengthen cloud security posture, and reducing API failures by 100K through systematic infrastructure improvements."
    },
    {
      "title": "Publicis Sapient",
      "link": "https://www.publicissapient.com/",
      "dates": "2022-2023",
      "position": "Senior Software Engineer",
      "skills": "Javascript, Typescript, Angular, ArcGIS, AWS, Java, leadership",
      "description": "Led implementation and oversight of developers to deliver features ahead of schedule and improve company-wide velocity. Initiated and introduced major feature rewrites."
    },
    {
      "title": "Radiant (now Maxar)",
      "link": "https://www.maxar.com/",
      "dates": "2018-2022",
      "position": "Software Engineer II",
      "skills": "Javascript, Typescript, Angular, Cesium, LeafletJS, ArcGIS, AWS, culture",
      "description": "Mid-level frontend engineer on mapping systems that informed national security needs. Champion and advocate for company culture."
    },
    {
      "title": "MITRE Corporation",
      "link": "https://www.mitre.org/",
      "dates": "2016-2018",
      "position": "Software Engineer I",
      "skills": "Javascript, Typescript, Angular, Python, Python Django, AWS, research",
      "description": "Engineer, researcher and experimenter in national initiatives addressing cloud, cyber security, and tax system shortages."
    },
    {
      "title": "Meal Fairy, LLC",
      "link": "https://meal-fairy-ce3bf.web.app/",
      "dates": "2018 (self-employed)",
      "position": "Founder",
      "skills": "Javascript, Typescript, Angular, Firebase, Stripe, startup, marketing",
      "description": "Founder for a plate to door food delivery startup in the greater Washington DC area."
    },
    {
      "title": "America's Electric Cooperatives",
      "link": "https://www.electric.coop/",
      "dates": "2014-2016 (contract)",
      "position": "Software Engineer",
      "skills": "Javascript, jQuery, Python, Python-Flask, research",
      "description": "Fullstack engineer for America's cooperatives. Committed to stewarding sustainability in energy generation and <a href=\"assets/data/documents/OMF-DR.pdf\" download=\"OMF-Energy-Demand-Response\" style=\"color: #039be5;\">cutting edge research.</a>"
    }
  ],
  "activities": {
    "teaching": {
      "position": "Substitute Teacher",
      "dates": "2024",
      "description": "Public school teacher and instructional assistant for elementary, middle and high schools across Fairfax County and Southern Bethesda in Maryland and Virginia across English, Math, for emotionally limited and special needs students."
    },
    "volunteering": {
      "position": "Volunteering",
      "dates": "2013-present",
      "description": "Volunteering and service across a variety of initiatives including: Food distribution and drives, STEM Students Lego Mindstorm & ARCHR robotics demo, Local community initiatives for the underserved and more."
    },
    "travel": {
      "position": "Nomadic Travel",
      "dates": "2020-2023",
      "description": "Travel and living in a variety of locations from the West Coast, California, stewarding sustainability in ecovillages in California and Hawaii, to car camping across national parks across Washington, Oregon and California,"
    },
    "jung": {
      "title": "Applied Jung,",
      "link": "https://appliedjung.com",
      "position": "Community Building",
      "dates": "2021-present",
      "skills": "Analytical psychology, community men's work, embodiment & mindfulness",
      "description": "Training and application of community building and Jungian individuation techniques, holding <a href=\"https://thebeingman.com\" target=\"_blank\">a community space</a> for men to learn healthy models of masculinity."
    }
  },
  "educationProjects": {
    "archr": {
      "title": "ARCHR Humanoid Robot",
      "link": "https://www.youtube.com/watch?v=GSx22ggePHw",
      "dates": "2013-2014",
      "position": "Lead Developer",
      "skills": "Javascript, Typescript, Angular, AWS, Java, innovation",
      "description": "Humanoid robot <span><a href=\"assets/data/documents/GMU-ARCHR.pdf\" download=\"ARCHR - Apparatus for Remote Control of Humanoid Robot\" style=\"color: #039be5;\">published</a></span>, taken to DARPA robotics challenge, and designed to address Daiichi Nuclear disaster response. Simplistic one-to-one hand-puppetered mimickry with Oculus VR streaming, controllers for ARCHR, Mini-Hubo, and Baxter robots."
    },
    "solar": {
      "title": "Solar Collaborative Workspace",
      "dates": "2013-2014",
      "position": "Lead Developer",
      "skills": "Solidworks, wiring schematics, sustainability and clean energy",
      "description": "Contributor who designed mechanics in solidworks 3D and wire drawings."
    },
    "dome": {
      "title": "DC Dome Light (family)",
      "dates": "2014",
      "position": "CAD Designer",
      "skills": "Solidworks, wiring schematics, sustainability and clean energy",
      "description": "Designed dome light in 3D for use for external vendors outsourcing. Design was too complex to be used."
    }
  },
  "publishedWorks": [
    {
      "title": "Apparatus for Remote Control of Humanoid Robots",
      "downloadPath": "assets/data/documents/GMU-ARCHR.pdf",
      "downloadFilename": "ARCHR-Apparatus-for-Remote-Control of-Humanoid-Robot"
    },
    {
      "title": "Open Modeling Framework Demand Response",
      "downloadPath": "assets/data/documents/OMF-DR.pdf",
      "downloadFilename": "OMF-Energy-Demand-Response"
    }
  ],
  "education": {
    "institution": "George Mason University",
    "dates": "2009-2015",
    "degree": "Electrical Engineering, B.S."
  }
}
